Config/Documents/АктСписанияМягкогоИХозИнвентаряОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктСписанияМягкогоИХозИнвентаряОС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрослеживаемыеОС</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.ОперацииСПрослеживаемымиТоварами</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>AccumulationRegister.ПрослеживаемыеТовары</xr:Item>
				<xr:Item>AccumulationRegister.РезервОС</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОСПоКонтрагентам</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПередачиОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьНаХранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМОПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключениеКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОперацииПрослеживаемости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыОперацийПрослеживаемости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резервировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аннулирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНорма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрослеживаемыйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СведенияПрослеживаемости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комплектующее</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураПрослеживаемость</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РНПТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПрослеживаемости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СоответствиеСчетовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеСчетовОС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетАмортизации</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетОбесценения</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗабалансовыйСчет</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПередачиВАренду</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПередачиВПользование</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПередачиВУправление</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетОС</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/АктСписанияМягкогоИХозИнвентаряОС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Настройка недоступности элементов таблицы.
// Ключ структуры - Имя табличной части, значение - массив имен реквизитов табличной части.
// 
// Возвращаемое значение:
//  Структура - Настройка недоступности элементов таблицы
Функция НастройкаНедоступностиЭлементовТаблицы() Экспорт
	Результат = Новый Структура;
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("ОсновноеСредство");
	ИменаРеквизитов.Добавить("ИнвентарныйНомер");
	ИменаРеквизитов.Добавить("КПС");
	ИменаРеквизитов.Добавить("СчетУчета");
	ИменаРеквизитов.Добавить("Количество");
	ИменаРеквизитов.Добавить("Цена");
	ИменаРеквизитов.Добавить("СуммаАмортизации");
	ИменаРеквизитов.Добавить("Сумма");
	Результат.Вставить("ОсновныеСредства", ИменаРеквизитов);
	Возврат Результат;
КонецФункции

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, 
	"ВидОперации, ПринятьНаХранение, Резервировать");
	
	Если РеквизитыДокумента.Резервировать Тогда
		Возврат;
	КонецЕсли;	
	
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента", УправлениеОсновнымиСредствами.НаименованиеПечатнойФормы("0504143"));
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка КАК Ссылка,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК Дата,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМОПолучатель КАК ЦМОПолучатель,
	|	ТаблицаОсновныеСредства.Ссылка.Контрагент КАК Контрагент,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|		ИЛИ НЕ ТаблицаОсновныеСредства.ОсновноеСредство.ГрупповойУчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПообъектныйУчет,
	|	ТаблицаОсновныеСредства.Ссылка.ПринятьНаХранение КАК ПринятьНаХранение,
	|	"""" КАК ПричинаСписания
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.АктСписанияМягкогоИХозИнвентаряОС.ОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОсновныеСредства.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаСобственныхОС)
	|	И НЕ ТаблицаОсновныеСредства.ПринятьНаХранение
	|	И ТаблицаОсновныеСредства.ПообъектныйУчет";
	
	// Движения по регистрам СтоимостьОбъектовОС и АмортизацияОбъектовОС.
	// Амортизация линейным способом не начисляется.
	ПараметрыСписания = УправлениеОсновнымиСредствами.ПараметрыСписанияОСПоРегистрамНакопления(РеквизитыДокумента.ВидОперации);
	ПараметрыСписания.НачислитьАмортизациюПриСписании = Ложь;
	Если РеквизитыДокумента.ПринятьНаХранение Тогда
		ПараметрыСписания.ВидРаспоряженияУКонтрагента	= Перечисления.ВидыРаспоряженияОС.НаХранении;
		ПараметрыСписания.ПоступлениеКонтрагенту		= Истина;
	КонецЕсли;
	УправлениеОсновнымиСредствами.ДобавитьТаблицыСписанияОСПоРегистрамНакопления(Запрос, НомераТаблиц,
		ДокументСсылка, ПараметрыСписания);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.АктСписанияМягкогоИХозИнвентаряОС";
	КомандаПечати.Идентификатор		= "АктСписанияОС0504143_103н";
	КомандаПечати.Представление		= НСтр("ru = 'Акт о списании мягкого и хоз. инвентаря (ф. 0504143) (52, ред. 103н)'");
	КомандаПечати.Порядок			= 1;
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.АктСписанияМягкогоИХозИнвентаряОС";
	КомандаПечати.Идентификатор		= "АктСписанияОС0504143_52н";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Акт о списании мягкого и хоз. инвентаря (ф. 0504143) (52н)'");
	КомандаПечати.Порядок			= 101;
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.АктСписанияМягкогоИХозИнвентаряОС";
	КомандаПечати.Идентификатор		= "АктСписанияОС0504143";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Акт о списании мягкого и хоз. инвентаря (ф. 0504143) (173н)'");
	КомандаПечати.Порядок			= 102;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// Проверяем, нужно ли для макета формировать табличный документ.
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСписанияОС0504143_103н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"АктСписанияОС0504143_103н",
		"Списание материалов",
		ПечатьАктСписанияМягкогоИнвентаря(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктСписанияМягкогоИнвентаря0504143_103н"));
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСписанияОС0504143_52н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"АктСписанияОС0504143_52н",
		"Списание материалов",
		ПечатьАктСписанияМягкогоИнвентаря(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктСписанияМягкогоИнвентаря504143_52н"));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСписанияОС0504143") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"АктСписанияОС0504143",
			"Списание материалов",
			ПечатьАктСписанияМягкогоИнвентаря(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктСписанияМягкогоИнвентаря0504143"));
	КонецЕсли;

КонецПроцедуры

Функция ПечатьАктСписанияМягкогоИнвентаря(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "АктСписанияМягкогоИнвентаря_0504143";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет." + ИмяМакета);
	
	ОбластьМакетаЗаголовок  			= Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакетаШапка      			= Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаСтрока     			= Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаИтого      			= Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаСтр2Начало 			= Макет.ПолучитьОбласть("Стр2Начало");
	ОбластьМакетаСтр2Заголовок			= Макет.ПолучитьОбласть("Стр2Заголовок");
	ОбластьМакетаСтр2ЗаключениеКомиссии	= Макет.ПолучитьОбласть("Стр2ЗаключениеКомиссии");
	ОбластьМакетаСтр2ПустоеЗаключение	= Макет.ПолучитьОбласть("Стр2ПустоеЗаключение");
	ОбластьМакетаКомиссия   			= Макет.ПолучитьОбласть("Комиссия");
	ОбластьМакетаСтр2       			= Макет.ПолучитьОбласть("Стр2");
	ОбластьМакетаСтр2Шапка  			= Макет.ПолучитьОбласть("Стр2Шапка");
	ОбластьМакетаСтр2Строка				= Макет.ПолучитьОбласть("Стр2Строка");
	ОбластьМакетаСтр2Подвал 			= Макет.ПолучитьОбласть("Стр2Подвал");
	ОбластьМакетаПодвал     			= Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФИОФизЛиц.Дата,
	|	ФИОФизическихЛиц.Фамилия,
	|	ФИОФизическихЛиц.Имя,
	|	ФИОФизическихЛиц.Отчество,
	|	ФИОФизЛиц.ЦМО,
	|	ФИОФизЛиц.АктСписанияСсылка
	|ПОМЕСТИТЬ ФИОФизЛиц
	|ИЗ
	|	(ВЫБРАТЬ
	|		ФизЛицаДокументов.Дата КАК Дата,
	|		ФизЛицаДокументов.ФизЛицоСсылка КАК ФизЛицоСсылка,
	|		МАКСИМУМ(ФИОФизическихЛиц.Период) КАК МаксимумПериод,
	|		ФизЛицаДокументов.ЦМО КАК ЦМО,
	|		ФизЛицаДокументов.АктСписанияСсылка КАК АктСписанияСсылка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			АктСписанияМягкогоИХозИнвентаряОС.Дата КАК Дата,
	|			ФизическиеЛица.Ссылка КАК ФизЛицоСсылка,
	|			АктСписанияМягкогоИХозИнвентаряОС.ЦМО КАК ЦМО,
	|			АктСписанияМягкогоИХозИнвентаряОС.Ссылка КАК АктСписанияСсылка
	|		ИЗ
	|			Документ.АктСписанияМягкогоИХозИнвентаряОС КАК АктСписанияМягкогоИХозИнвентаряОС
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦМО КАК СправочникЦМО
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|							ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|							ПО Контрагенты.ЮридическоеФизическоеЛицо = ФизическиеЛица.Ссылка
	|						ПО Сотрудники.Контрагент = Контрагенты.Ссылка
	|					ПО СправочникЦМО.Сотрудник = Сотрудники.Ссылка
	|				ПО АктСписанияМягкогоИХозИнвентаряОС.ЦМО = СправочникЦМО.Ссылка
	|		ГДЕ
	|			АктСписанияМягкогоИХозИнвентаряОС.Ссылка В(&МассивОбъектов)) КАК ФизЛицаДокументов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|			ПО ФизЛицаДокументов.ФизЛицоСсылка = ФИОФизическихЛиц.ФизическоеЛицо
	|				И (ФИОФизическихЛиц.Период <= ФизЛицаДокументов.Дата)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ФизЛицаДокументов.Дата,
	|		ФизЛицаДокументов.ФизЛицоСсылка,
	|		ФизЛицаДокументов.ЦМО,
	|		ФизЛицаДокументов.АктСписанияСсылка) КАК ФИОФизЛиц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|		ПО ФИОФизЛиц.ФизЛицоСсылка = ФИОФизическихЛиц.ФизическоеЛицо
	|			И ФИОФизЛиц.МаксимумПериод = ФИОФизическихЛиц.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Бухгалтерский
	|ПОМЕСТИТЬ ВсеДвижения
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(, , Регистратор В (&МассивОбъектов), , ) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Бухгалтерский
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеДвижения.Регистратор,
	|	ВсеДвижения.СчетДт,
	|	ВсеДвижения.КПСДт,
	|	ВсеДвижения.КЭКДт,
	|	ВсеДвижения.СчетКт,
	|	ВсеДвижения.КПСКт,
	|	ВсеДвижения.КЭККт,
	|	ВсеДвижения.ОсновноеСредство
	|ПОМЕСТИТЬ Движения
	|ИЗ
	|	ВсеДвижения КАК ВсеДвижения
	|ГДЕ
	|	ВсеДвижения.Бухгалтерский = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеДвижения.Регистратор,
	|	ВсеДвижения.СчетДт,
	|	ВсеДвижения.КПСДт,
	|	ВсеДвижения.КЭКДт,
	|	ВсеДвижения.СчетКт,
	|	ВсеДвижения.КПСКт,
	|	ВсеДвижения.КЭККт,
	|	ВсеДвижения.ОсновноеСредство
	|ИЗ
	|	ВсеДвижения КАК ВсеДвижения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОС
	|		ПО ВсеДвижения.СчетКт = СоответствиеСчетовОС.ЗабалансовыйСчет
	|ГДЕ
	|	ВсеДвижения.Бухгалтерский = ЛОЖЬ
	|	И НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА КАК Поле1
	|				ИЗ
	|					ВсеДвижения КАК ВсеДвижения1
	|				ГДЕ
	|					ВсеДвижения1.Регистратор = ВсеДвижения.Регистратор
	|					И ВсеДвижения1.Бухгалтерский = ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВсеДвижения";
	Запрос.Выполнить();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктСписанияМягкогоИХозИнвентаряОС.Ссылка КАК Ссылка,
	|	АктСписанияМягкогоИХозИнвентаряОС.Номер КАК пНомер,
	|	АктСписанияМягкогоИХозИнвентаряОС.Дата КАК пДата,
	|	АктСписанияМягкогоИХозИнвентаряОС.Организация,
	|	ВЫБОР
	|		КОГДА АктСписанияМягкогоИХозИнвентаряОС.Организация.НаименованиеПолное = """"
	|			ТОГДА АктСписанияМягкогоИХозИнвентаряОС.Организация.Наименование
	|		ИНАЧЕ АктСписанияМягкогоИХозИнвентаряОС.Организация.НаименованиеПолное
	|	КОНЕЦ КАК пНаименованиеОрганизации,
	|	ВЫБОР
	|		КОГДА АктСписанияМягкогоИХозИнвентаряОС.Подразделение.НаименованиеПолное = """"
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(АктСписанияМягкогоИХозИнвентаряОС.Подразделение)
	|		ИНАЧЕ АктСписанияМягкогоИХозИнвентаряОС.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК пПодразделение,
	|	АктСписанияМягкогоИХозИнвентаряОС.Организация.ИНН КАК ИНН,
	|	ВЫБОР
	|		КОГДА АктСписанияМягкогоИХозИнвентаряОС.Подразделение.ОбособленноеПодразделение
	|			ТОГДА АктСписанияМягкогоИХозИнвентаряОС.Подразделение.РегистрацияВНалоговомОргане.КПП
	|		ИНАЧЕ АктСписанияМягкогоИХозИнвентаряОС.Организация.КПП
	|	КОНЕЦ КАК КПП,
	|	АктСписанияМягкогоИХозИнвентаряОС.Организация.КодОКПО КАК пКодОКПО,
	|	АктСписанияМягкогоИХозИнвентаряОС.ЦМО,
	|	АктСписанияМягкогоИХозИнвентаряОС.ДолжностьПредседателяКомиссии,
	|	АктСписанияМягкогоИХозИнвентаряОС.ФамилияПредседателяКомиссии,
	|	АктСписанияМягкогоИХозИнвентаряОС.ИмяПредседателяКомиссии,
	|	АктСписанияМягкогоИХозИнвентаряОС.ОтчествоПредседателяКомиссии,
	|	АктСписанияМягкогоИХозИнвентаряОС.НомерПриказа КАК пНомерПриказа,
	|	АктСписанияМягкогоИХозИнвентаряОС.ДатаПриказа КАК пДатаПриказа,
	|	АктСписанияМягкогоИХозИнвентаряОС.ЗаключениеКомиссии,
	|	АктСписанияМягкогоИХозИнвентаряОС.КФО,
	|	АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.КПС.Представление,
	|	АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.НомерСтроки КАК пНомерСтроки,
	|	АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.ОсновноеСредство.Представление КАК пНоменклатура,
	|	АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.ИнвентарныйНомер.Представление,
	|	АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ЕСТЬNULL(АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.КоличествоНорма, 0) КАК КоличествоНорма,
	|	ЕСТЬNULL(АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.Количество, 0) КАК пКоличество,
	|	ЕСТЬNULL(АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.Цена, 0) КАК пЦена,
	|	ЕСТЬNULL(АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.Сумма, 0) КАК пСумма,
	|	ЕСТЬNULL(АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.СуммаАмортизации, 0) КАК СуммаАмортизации,
	|	"""" КАК пПричинаСписания,
	|	АктСписанияМягкогоИХозИнвентаряОС.ЦМО.Сотрудник КАК МОЛСсылка,
	|	АктСписанияМягкогоИХозИнвентаряОС.ЦМО.Сотрудник.Код КАК пТабНомМОЛ,
	|	Движения.СчетДт КАК СчетДтСсылка,
	|	Движения.СчетДт.Представление КАК СчетДт,
	|	Движения.КПСДт.Представление КАК КПСДт,
	|	Движения.КЭКДт.Представление КАК КЭКДт,
	|	Движения.СчетКт КАК СчетКтСсылка,
	|	Движения.СчетКт.Представление КАК СчетКт,
	|	Движения.КПСКт.Представление КАК КПСКт,
	|	Движения.КЭККт.Представление КАК КЭККт,
	|	ФИОФизЛиц.Фамилия КАК МОЛФамилия,
	|	ФИОФизЛиц.Имя КАК МОЛИмя,
	|	ФИОФизЛиц.Отчество КАК МОЛОтчество
	|ИЗ
	|	Документ.АктСписанияМягкогоИХозИнвентаряОС КАК АктСписанияМягкогоИХозИнвентаряОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФИОФизЛиц КАК ФИОФизЛиц
	|		ПО АктСписанияМягкогоИХозИнвентаряОС.Ссылка = ФИОФизЛиц.АктСписанияСсылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктСписанияМягкогоИХозИнвентаряОС.ОсновныеСредства КАК АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства
	|			ЛЕВОЕ СОЕДИНЕНИЕ Движения КАК Движения
	|			ПО АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.Ссылка = Движения.Регистратор
	|				И АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.ОсновноеСредство = Движения.ОсновноеСредство
	|		ПО АктСписанияМягкогоИХозИнвентаряОС.Ссылка = АктСписанияМягкогоИХозИнвентаряОСОсновныеСредства.Ссылка
	|ГДЕ
	|	АктСписанияМягкогоИХозИнвентаряОС.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	пДата,
	|	пНомер,
	|	пНомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(МОЛФамилия),
	|	МАКСИМУМ(МОЛИмя),
	|	МАКСИМУМ(МОЛОтчество)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктСписанияМягкогоИХозИнвентаряОССоставКомиссии.Ссылка КАК Ссылка,
	|	АктСписанияМягкогоИХозИнвентаряОССоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	АктСписанияМягкогоИХозИнвентаряОССоставКомиссии.ДолжностьЧленаКомиссии,
	|	АктСписанияМягкогоИХозИнвентаряОССоставКомиссии.ФамилияЧленаКомиссии,
	|	АктСписанияМягкогоИХозИнвентаряОССоставКомиссии.ИмяЧленаКомиссии,
	|	АктСписанияМягкогоИХозИнвентаряОССоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.АктСписанияМягкогоИХозИнвентаряОС.СоставКомиссии КАК АктСписанияМягкогоИХозИнвентаряОССоставКомиссии
	|ГДЕ
	|	АктСписанияМягкогоИХозИнвентаряОССоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	
	Выборка = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКомиссия = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакетаЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьМакетаЗаголовок.Параметры.Заполнить(Новый Структура("пДатаУтверждения", """____"" ________________ 20____г."));
		Руководитель = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(Выборка.Организация,
																					Перечисления.ОтветственныеЛицаОрганизаций.Руководитель,
																					Выборка.пДата);
		ОбластьМакетаЗаголовок.Параметры.пДиректор 	= Справочники.Сотрудники.ФамилияИО(Руководитель.ОтветственноеЛицоСсылка, Истина, Выборка.пДата);
		ОбластьМакетаЗаголовок.Параметры.пМОЛ 		= "" + Выборка.МОЛФамилия + " " + Выборка.МОЛИмя + " " + Выборка.МОЛОтчество;
		пДатаПриказа = "";
		Если ЗначениеЗаполнено(Выборка.пДатаПриказа) Тогда
			пДатаПриказа = Формат(Выборка.пДатаПриказа,"ДЛФ=ДД");
		КонецЕсли;	
		ОбластьМакетаЗаголовок.Параметры.пДатаПриказа = пДатаПриказа;
		ОбластьМакетаЗаголовок.Параметры.пДатаЗаголовка = Формат(Выборка.пДата,"ДЛФ=ДД");
		
		ВыборкаКомиссия.Сбросить();																				
		СтруктураПоиска = Новый Структура("Ссылка", Выборка.Ссылка);
		Если ВыборкаКомиссия.НайтиСледующий(СтруктураПоиска) Тогда
			ВыборкаКомиссияТекДок = ВыборкаКомиссия.Выбрать();
		Иначе
			ВыборкаКомиссияТекДок = Неопределено;
		КонецЕсли;
		пЧленыКомиссии = "";
		ОбластьКомиссия = УправлениеОсновнымиСредствами.СформироватьОбластьКомиссия(Выборка, ВыборкаКомиссияТекДок, ОбластьМакетаКомиссия, 3, пЧленыКомиссии, Истина);
		ОбластьМакетаЗаголовок.Параметры.пЧленыКомиссии = пЧленыКомиссии;
		
		//НастройкаПечатиНомера
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(ОбластьМакетаЗаголовок,"пНомер",Выборка.пНомер,Выборка.Ссылка,Неопределено, Истина);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
		
		пКоличествоИтого = 0;
		пСуммаИтого		 = 0;
		ВыборкаСтрок = Выборка.Выбрать();
		Пока ВыборкаСтрок.Следующий() Цикл
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрок);
			ПредставлениеСчетДт = "";
			Если ЗначениеЗаполнено(ВыборкаСтрок.СчетДтСсылка) Тогда
				ПредставлениеСчетДт	= "" + ВыборкаСтрок.КПСДт;
				ПредставлениеСчетДт = ПредставлениеСчетДт
									+ ?(ПустаяСтрока(ПредставлениеСчетДт), "", ".")
									+ ВыборкаСтрок.КФО;
				ПредставлениеСчетДт = ПредставлениеСчетДт
									+ ?(ПустаяСтрока(ПредставлениеСчетДт), "", ".")
									+ ВыборкаСтрок.СчетДт;
				ПредставлениеСчетДт = ПредставлениеСчетДт
									+ ?(ПустаяСтрока(ПредставлениеСчетДт) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаСтрок.КЭКДт), "", ".")
									+ ВыборкаСтрок.КЭКДт;
			КонецЕсли;
			
			ПредставлениеСчетКт	= "";
			Если ЗначениеЗаполнено(ВыборкаСтрок.СчетКтСсылка) Тогда
				ПредставлениеСчетКт	= "" + ВыборкаСтрок.КПСКт;
				ПредставлениеСчетКт = ПредставлениеСчетКт
									+ ?(ПустаяСтрока(ПредставлениеСчетКт), "", ".")
									+ ВыборкаСтрок.КФО;
				ПредставлениеСчетКт = ПредставлениеСчетКт
									+ ?(ПустаяСтрока(ПредставлениеСчетКт), "", ".")
									+ ВыборкаСтрок.СчетКт;
				ПредставлениеСчетКт = ПредставлениеСчетКт
									+ ?(ПустаяСтрока(ПредставлениеСчетКт) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаСтрок.КЭККт), "", ".")
									+ ВыборкаСтрок.КЭККт;
			КонецЕсли;
			
			СтруктураОбластьМакетаСтрока = Новый Структура("пСчетДебета,пСчетКредита",ПредставлениеСчетДт,ПредставлениеСчетКт);			
			
			СрокЭксплуатации = УправлениеОсновнымиСредствами.ФактическийСрокЭксплуатации(
				ВыборкаСтрок.ОсновноеСредство, ВыборкаСтрок.ИнвентарныйНомер, Выборка.Организация, Выборка.пДата);
			пСрокЭксплуатации = УправлениеОсновнымиСредствами.МесяцВГод(СрокЭксплуатации);
			
			СтруктураОбластьМакетаСтрока.Вставить("пСрокЭксплуатации", пСрокЭксплуатации);
			
			ОбластьМакетаСтрока.Параметры.Заполнить(СтруктураОбластьМакетаСтрока);
			
			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
			
			пКоличествоИтого = пКоличествоИтого + ВыборкаСтрок.пКоличество;
			пСуммаИтого		 = пСуммаИтого		+ ВыборкаСтрок.пСумма;
		КонецЦикла;
		СтруктураОбластьМакетаИтого = Новый Структура("пКоличествоИтого,пСуммаИтого",пКоличествоИтого,пСуммаИтого);
		ОбластьМакетаИтого.Параметры.Заполнить(СтруктураОбластьМакетаИтого);

		ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		СтруктураОбластьМакетаСтр2Начало = Новый Структура;
		Если пКоличествоИтого = Цел(пКоличествоИтого) Тогда
			СтруктураОбластьМакетаСтр2Начало.Вставить("пКоличествоИтогоПрописью",ЧислоПрописью(пКоличествоИтого,,"штука,штуки,штук,ж,,,,,0"));
		Иначе
			СтруктураОбластьМакетаСтр2Начало.Вставить("пКоличествоИтогоПрописью","");
		КонецЕсли;
		Если пСуммаИтого <> 0 Тогда
			СтруктураОбластьМакетаСтр2Начало.Вставить("пСуммаИтогоПрописью",ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(пСуммаИтого, 
																		Константы.ВалютаРегламентированногоУчета.Получить()));
		Иначе																		
			СтруктураОбластьМакетаСтр2Начало.Вставить("пСуммаИтогоПрописью", "");
		КонецЕсли;
		СтруктураОбластьМакетаСтр2Начало.Вставить("ЗаключениеКомиссии", Выборка.ЗаключениеКомиссии);
		ОбластьМакетаСтр2Начало.Параметры.Заполнить(СтруктураОбластьМакетаСтр2Начало);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаСтр2Начало);
		
		// комиссия
		ТабличныйДокумент.Вывести(ОбластьКомиссия);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаСтр2Шапка);
		
		ПодвалСтраницы2 = Новый Массив;
		ПодвалСтраницы2.Добавить(ОбластьМакетаСтр2Строка);
		ПодвалСтраницы2.Добавить(ОбластьМакетаСтр2Строка);
		ПодвалСтраницы2.Добавить(ОбластьМакетаСтр2Подвал);
		ПодвалСтраницы2.Добавить(ОбластьКомиссия);
		ПодвалСтраницы2.Добавить(ОбластьМакетаПодвал);
		
		Пока ТабличныйДокумент.ПроверитьВывод(ПодвалСтраницы2) Цикл
			ТабличныйДокумент.Вывести(ОбластьМакетаСтр2Строка);	
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаСтр2Строка);
		ТабличныйДокумент.Вывести(ОбластьМакетаСтр2Подвал);
		
		// комиссия
		ТабличныйДокумент.Вывести(ОбластьКомиссия);
		ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);

		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
